{"k1": 1.5, "b": 0.75, "avgdl": 8.5, "next_id": 679, "vocab": {"customize": 0, "mac": 1, "your": 2, "os": 3, "list": 4, "idea": 5, "saving": 6, "ide": 7, "atlassian": 8, "python": 9, "com": 10, "examples": 11, "wmv": 12, "ignored": 13, "applicable": 14, "py": 15, "db": 16, "media": 17, "https": 18, "package": 19, "app": 20, "avi": 21, "text": 22, "more": 23, "some": 24, "gitignore": 25, "brains": 26, "war": 27, "windows": 28, "mov": 29, "project": 30, "about": 31, "jar": 32, "tutorials": 33, "store": 34, "jet": 35, "maven": 36, "compiled": 37, "log": 38, "ds": 39, "large": 40, "tiff": 41, "dist": 42, "changes": 43, "java": 44, "test": 45, "thumbs": 46, "target": 47, "these": 48, "files": 49, "modules": 50, "unit": 51, "xml": 52, "commonly": 53, "git": 54, "flv": 55, "artifact": 56, "mp4": 57, "www": 58, "node": 59, "exe": 60, "learn": 61, "applications": 62, "patterns": 63, "cod": 64, "reports": 65, "file": 66, "generated": 67, "chunk": 68, "bytecode": 69, "doc": 70, "pathlib": 71, "results": 72, "split": 73, "types": 74, "size": 75, "dirs": 76, "ok": 77, "png": 78, "collect": 79, "lock": 80, "calls": 81, "parts": 82, "replace": 83, "read": 84, "build": 85, "walk": 86, "pyo": 87, "re": 88, "lower": 89, "ext": 90, "woff2": 91, "window": 92, "wav": 93, "call": 94, "line": 95, "context": 96, "mypy": 97, "sliding": 98, "config": 99, "dict": 100, "suffix": 101, "id": 102, "intact": 103, "existing": 104, "optional": 105, "tokens": 106, "svg": 107, "sum": 108, "tree": 109, "bytes": 110, "40": 111, "children": 112, "gif": 113, "repo": 114, "encoding": 115, "zip": 116, "any": 117, "lang": 118, "raw": 119, "root": 120, "src": 121, "map": 122, "tuple": 123, "notebook": 124, "slide": 125, "set": 126, "errors": 127, "utf": 128, "lines": 129, "identifier": 130, "mp3": 131, "dll": 132, "markdown": 133, "language": 134, "extract": 135, "limit": 136, "pycache": 137, "overlap": 138, "changed": 139, "returns": 140, "pyc": 141, "woff": 142, "exts": 143, "max": 144, "tar": 145, "start": 146, "gz": 147, "jpeg": 148, "deps": 149, "nested": 150, "type": 151, "make": 152, "skip": 153, "jpg": 154, "str": 155, "pyd": 156, "depth": 157, "resolve": 158, "50": 159, "code": 160, "int": 161, "ttf": 162, "len": 163, "name": 164, "ico": 165, "names": 166, "chunks": 167, "sitter": 168, "300": 169, "eot": 170, "child": 171, "path": 172, "bin": 173, "400": 174, "venv": 175, "nbformat": 176, "cache": 177, "typing": 178, "buf": 179, "pytest": 180, "approx": 181, "full": 182, "else": 183, "called": 184, "strip": 185, "symbol": 186, "unnamed": 187, "parent": 188, "simple": 189, "property": 190, "end": 191, "decode": 192, "byte": 193, "field": 194, "scoped": 195, "dotted": 196, "add": 197, "selector": 198, "qualified": 199, "get": 200, "elif": 201, "member": 202, "callee": 203, "expression": 204, "reversed": 205, "attribute": 206, "break": 207, "fill": 208, "key": 209, "globally": 210, "resolved": 211, "override": 212, "short": 213, "cid": 214, "pass": 215, "back": 216, "pop": 217, "runs": 218, "still": 219, "ch": 220, "resolves": 221, "qdrant": 222, "append": 223, "ids": 224, "cross": 225, "fresher": 226, "incremental": 227, "correctly": 228, "populated": 229, "seen": 230, "mutate": 231, "provided": 232, "only": 233, "here": 234, "conflict": 235, "unchanged": 236, "pre": 237, "extend": 238, "syms": 239, "point": 240, "ctx": 241, "scope": 242, "splitlines": 243, "content": 244, "join": 245, "while": 246, "step": 247, "piece": 248, "local": 249, "all": 250, "fromkeys": 251, "failed": 252, "removed": 253, "once": 254, "chunker": 255, "parse": 256, "fn": 257, "now": 258, "except": 259, "try": 260, "parser": 261, "encode": 262, "exception": 263, "print": 264, "open": 265, "isinstance": 266, "md": 267, "continue": 268, "version": 269, "cells": 270, "nb": 271, "source": 272, "range": 273, "8000": 274, "cell": 275, "enumerate": 276, "startswith": 277, "isspace": 278, "section": 279, "match": 280, "combined": 281, "part": 282, "cannot": 283, "yaml": 284, "markup": 285, "stem": 286, "json": 287, "css": 288, "mdx": 289, "csv": 290, "ipynb": 291, "yml": 292, "style": 293, "rst": 294, "toml": 295, "html": 296, "scss": 297, "unknown": 298, "spec": 299, "txt": 300, "total": 301, "sorted": 302, "dep": 303, "scroll": 304, "ingestor": 305, "each": 306, "global": 307, "before": 308, "against": 309, "rel": 310, "fine": 311, "symbols": 312, "rglob": 313, "index": 314, "relative": 315, "built": 316, "relevant": 317, "seeds": 318, "args": 319, "dir": 320, "every": 321, "chunked": 322, "other": 323, "after": 324, "resolution": 325, "posix": 326, "good": 327, "32": 328, "greetings": 329, "getenv": 330, "000": 331, "batch": 332, "teh": 333, "emebd": 334, "ollama": 335, "http": 336, "qwen3": 337, "per": 338, "embedding": 339, "change": 340, "somthing": 341, "localhost": 342, "way": 343, "11434": 344, "base": 345, "model": 346, "token": 347, "chars": 348, "available": 349, "when": 350, "huihui": 351, "embed": 352, "requests": 353, "url": 354, "embedd": 355, "6b": 356, "jejejejejejjej": 357, "via": 358, "embedder": 359, "dense": 360, "vocab": 361, "payload": 362, "bool": 363, "float": 364, "vectors": 365, "same": 366, "both": 367, "current": 368, "vector": 369, "ingest": 370, "order": 371, "bm25": 372, "strings": 373, "bm25encoder": 374, "input": 375, "save": 376, "encoder": 377, "updated": 378, "api": 379, "persist": 380, "batches": 381, "texts": 382, "sparse": 383, "create": 384, "load": 385, "timeout": 386, "error": 387, "response": 388, "exceptions": 389, "runtime": 390, "raise": 391, "serve": 392, "running": 393, "connect": 394, "embeddings": 395, "connection": 396, "status": 397, "post": 398, "embedded": 399, "vec": 400, "indices": 401, "idx": 402, "during": 403, "dicts": 404, "enc": 405, "values": 406, "search": 407, "svec": 408, "fit": 409, "computing": 410, "idf": 411, "steps": 412, "reflects": 413, "dvec": 414, "updates": 415, "corpus": 416, "attach": 417, "argparse": 418, "descriptions": 419, "subprocess": 420, "describer": 421, "clone": 422, "clean": 423, "branch": 424, "rstrip": 425, "repos": 426, "saves": 427, "commit": 428, "reuse": 429, "sub": 430, "main": 431, "rev": 432, "head": 433, "run": 434, "hybrid": 435, "enrich": 436, "indexing": 437, "patch": 438, "bitbucket": 439, "makedirs": 440, "describe": 441, "weights": 442, "dotenv": 443, "exist": 444, "pipeline": 445, "pull": 446, "inject": 447, "upsert": 448, "sha": 449, "result": 450, "delete": 451, "org": 452, "auth": 453, "z0": 454, "username": 455, "github": 456, "exists": 457, "pulling": 458, "remote": 459, "check": 460, "cloning": 461, "origin": 462, "latest": 463, "stdout": 464, "output": 465, "capture": 466, "process": 467, "falling": 468, "commits": 469, "diff": 470, "chunking": 471, "old": 472, "produced": 473, "indexed": 474, "done": 475, "generating": 476, "attaches": 477, "entire": 478, "collection": 479, "no": 480, "deleting": 481, "upserting": 482, "into": 483, "utils": 484, "started": 485, "processing": 486, "6333": 487, "filter": 488, "mode": 489, "struct": 490, "params": 491, "condition": 492, "uuid": 493, "missing": 494, "dim": 495, "value": 496, "collections": 497, "fetch": 498, "prefetch": 499, "close": 500, "fusion": 501, "named": 502, "query": 503, "configs": 504, "server": 505, "1024": 506, "paths": 507, "data": 508, "models": 509, "client": 510, "distance": 511, "60": 512, "using": 513, "connecting": 514, "storage": 515, "creating": 516, "disk": 517, "cosine": 518, "already": 519, "items": 520, "must": 521, "100": 522, "upserted": 523, "namespace": 524, "points": 525, "uuid5": 526, "uid": 527, "top": 528, "dot": 529, "product": 530, "native": 531, "header": 532, "best": 533, "similarity": 534, "rrf": 535, "conditions": 536, "fuse": 537, "inside": 538, "description": 539, "score": 540, "1000": 541, "entries": 542, "offset": 543, "deleted": 544, "getting": 545, "edit": 546, "youtu": 547, "update": 548, "our": 549, "tab": 550, "0ocf7u76w": 551, "watch": 552, "recommend": 553, "below": 554, "video": 555, "perform": 556, "avoid": 557, "another": 558, "repository": 559, "others": 560, "leaving": 561, "under": 562, "minutes": 563, "details": 564, "tutorial": 565, "readme": 566, "demo": 567, "tasks": 568, "just": 569, "ll": 570, "how": 571, "click": 572, "editing": 573, "making": 574, "left": 575, "following": 576, "button": 577, "dialog": 578, "made": 579, "again": 580, "see": 581, "side": 582, "page": 583, "link": 584, "go": 585, "empty": 586, "move": 587, "give": 588, "filename": 589, "contributors": 590, "branches": 591, "out": 592, "space": 593, "explore": 594, "enter": 595, "settings": 596, "ahead": 597, "next": 598, "ve": 599, "pages": 600, "iqy": 601, "destination": 602, "4wh": 603, "nq0z": 604, "use": 605, "dq": 606, "odq": 607, "heading": 608, "locally": 609, "prefer": 610, "install": 611, "free": 612, "allows": 613, "directory": 614, "yet": 615, "first": 616, "created": 617, "sourcetreeapp": 618, "account": 619, "familiar": 620, "don": 621, "download": 622, "command": 623, "confluence": 624, "like": 625, "work": 626, "push": 627, "mg": 628, "8qh": 629, "need": 630, "dedup": 631, "asynccontextmanager": 632, "request": 633, "rag": 634, "unique": 635, "lifespan": 636, "title": 637, "contextlib": 638, "fast": 639, "expand": 640, "pydantic": 641, "fastapi": 642, "rerank": 643, "up": 644, "loading": 645, "async": 646, "loads": 647, "warming": 648, "startup": 649, "ready": 650, "19": 651, "warmup": 652, "yield": 653, "warning": 654, "expanded": 655, "fetched": 656, "hops": 657, "count": 658, "candidate": 659, "slice": 660, "prefix": 661, "merge": 662, "sources": 663, "req": 664, "represent": 665, "detail": 666, "instruction": 667, "retrieving": 668, "endpoint": 669, "pool": 670, "108": 671, "merged": 672, "169": 673, "health": 674, "adding": 675, "msg": 676, "numbers": 677, "rusn": 678}, "idf": {"0": 3.7376696182833684, "1": 3.7376696182833684, "2": 2.4383866341531073, "3": 2.128231705849268, "4": 0.6618946370558408, "5": 3.7376696182833684, "6": 3.2268439945173775, "7": 3.7376696182833684, "8": 3.2268439945173775, "9": 3.2268439945173775, "10": 2.8903717578961645, "11": 3.7376696182833684, "12": 3.7376696182833684, "13": 3.7376696182833684, "14": 3.7376696182833684, "15": 2.6390573296152584, "16": 3.7376696182833684, "17": 3.7376696182833684, "18": 2.2713325494899412, "19": 3.7376696182833684, "20": 2.4383866341531073, "21": 3.7376696182833684, "22": 1.0750817912579156, "23": 2.8903717578961645, "24": 3.7376696182833684, "25": 3.7376696182833684, "26": 3.7376696182833684, "27": 3.7376696182833684, "28": 3.7376696182833684, "29": 3.7376696182833684, "30": 3.7376696182833684, "31": 3.7376696182833684, "32": 3.7376696182833684, "33": 3.7376696182833684, "34": 2.8903717578961645, "35": 3.7376696182833684, "36": 3.7376696182833684, "37": 3.7376696182833684, "38": 0.6931471805599453, "39": 3.7376696182833684, "40": 3.7376696182833684, "41": 3.7376696182833684, "42": 3.2268439945173775, "43": 3.7376696182833684, "44": 3.7376696182833684, "45": 3.2268439945173775, "46": 3.7376696182833684, "47": 2.4383866341531073, "48": 2.8903717578961645, "49": 1.7007876910223283, "50": 3.2268439945173775, "51": 3.7376696182833684, "52": 3.7376696182833684, "53": 3.7376696182833684, "54": 2.128231705849268, "55": 3.7376696182833684, "56": 3.7376696182833684, "57": 3.2268439945173775, "58": 3.2268439945173775, "59": 2.128231705849268, "60": 3.2268439945173775, "61": 3.2268439945173775, "62": 3.7376696182833684, "63": 3.7376696182833684, "64": 3.7376696182833684, "65": 3.7376696182833684, "66": 1.2039728043259361, "67": 3.7376696182833684, "68": 1.0750817912579156, "69": 3.7376696182833684, "70": 1.8918429277850375, "71": 3.7376696182833684, "72": 1.8918429277850375, "73": 2.003068562895262, "74": 2.4383866341531073, "75": 3.2268439945173775, "76": 3.2268439945173775, "77": 2.128231705849268, "78": 3.7376696182833684, "79": 2.8903717578961645, "80": 3.7376696182833684, "81": 1.791759469228055, "82": 2.8903717578961645, "83": 1.8918429277850375, "84": 2.8903717578961645, "85": 2.128231705849268, "86": 2.8903717578961645, "87": 3.7376696182833684, "88": 2.128231705849268, "89": 2.6390573296152584, "90": 3.2268439945173775, "91": 3.7376696182833684, "92": 2.6390573296152584, "93": 3.7376696182833684, "94": 2.2713325494899412, "95": 1.791759469228055, "96": 1.2039728043259361, "97": 3.7376696182833684, "98": 2.6390573296152584, "99": 2.6390573296152584, "100": 0.9444616088408513, "101": 2.8903717578961645, "102": 2.003068562895262, "103": 3.2268439945173775, "104": 2.128231705849268, "105": 2.128231705849268, "106": 1.791759469228055, "107": 3.7376696182833684, "108": 3.7376696182833684, "109": 2.6390573296152584, "110": 2.2713325494899412, "111": 3.2268439945173775, "112": 2.6390573296152584, "113": 3.7376696182833684, "114": 1.5404450409471488, "115": 2.6390573296152584, "116": 2.8903717578961645, "117": 1.0296194171811581, "118": 2.4383866341531073, "119": 2.003068562895262, "120": 2.6390573296152584, "121": 2.128231705849268, "122": 2.4383866341531073, "123": 3.2268439945173775, "124": 2.8903717578961645, "125": 2.8903717578961645, "126": 1.6174060820832772, "127": 2.2713325494899412, "128": 2.128231705849268, "129": 2.4383866341531073, "130": 2.8903717578961645, "131": 3.7376696182833684, "132": 3.7376696182833684, "133": 2.003068562895262, "134": 2.003068562895262, "135": 2.8903717578961645, "136": 2.8903717578961645, "137": 3.7376696182833684, "138": 2.8903717578961645, "139": 2.4383866341531073, "140": 2.4383866341531073, "141": 3.7376696182833684, "142": 3.7376696182833684, "143": 3.2268439945173775, "144": 2.2713325494899412, "145": 3.7376696182833684, "146": 1.5404450409471488, "147": 3.7376696182833684, "148": 3.7376696182833684, "149": 2.6390573296152584, "150": 3.7376696182833684, "151": 1.5404450409471488, "152": 2.003068562895262, "153": 2.6390573296152584, "154": 3.7376696182833684, "155": 0.46683405448445653, "156": 3.7376696182833684, "157": 3.2268439945173775, "158": 2.6390573296152584, "159": 3.7376696182833684, "160": 0.10536051565782635, "161": 1.5404450409471488, "162": 3.7376696182833684, "163": 1.3397743454849977, "164": 0.631589287560512, "165": 3.7376696182833684, "166": 2.4383866341531073, "167": 1.2809338454620642, "168": 2.8903717578961645, "169": 3.2268439945173775, "170": 3.7376696182833684, "171": 2.6390573296152584, "172": 0.8659899933993561, "173": 3.7376696182833684, "174": 2.8903717578961645, "175": 3.7376696182833684, "176": 3.2268439945173775, "177": 3.7376696182833684, "178": 2.4383866341531073, "179": 2.6390573296152584, "180": 3.7376696182833684, "181": 2.6390573296152584, "182": 2.2713325494899412, "183": 1.468986076965004, "184": 2.003068562895262, "185": 1.791759469228055, "186": 2.8903717578961645, "187": 2.6390573296152584, "188": 3.7376696182833684, "189": 3.2268439945173775, "190": 3.2268439945173775, "191": 2.8903717578961645, "192": 2.8903717578961645, "193": 3.2268439945173775, "194": 2.2713325494899412, "195": 3.7376696182833684, "196": 3.7376696182833684, "197": 0.6931471805599453, "198": 3.2268439945173775, "199": 3.7376696182833684, "200": 0.9044562742271522, "201": 2.4383866341531073, "202": 3.7376696182833684, "203": 3.2268439945173775, "204": 3.7376696182833684, "205": 3.7376696182833684, "206": 3.7376696182833684, "207": 2.8903717578961645, "208": 3.7376696182833684, "209": 2.128231705849268, "210": 2.8903717578961645, "211": 3.7376696182833684, "212": 3.7376696182833684, "213": 3.2268439945173775, "214": 3.2268439945173775, "215": 3.2268439945173775, "216": 2.4383866341531073, "217": 3.2268439945173775, "218": 2.8903717578961645, "219": 3.2268439945173775, "220": 3.7376696182833684, "221": 3.2268439945173775, "222": 1.5404450409471488, "223": 1.7007876910223283, "224": 2.4383866341531073, "225": 3.2268439945173775, "226": 3.7376696182833684, "227": 2.8903717578961645, "228": 3.2268439945173775, "229": 3.7376696182833684, "230": 2.6390573296152584, "231": 3.7376696182833684, "232": 3.7376696182833684, "233": 2.4383866341531073, "234": 3.2268439945173775, "235": 3.7376696182833684, "236": 3.2268439945173775, "237": 3.7376696182833684, "238": 2.8903717578961645, "239": 3.2268439945173775, "240": 2.8903717578961645, "241": 2.8903717578961645, "242": 3.7376696182833684, "243": 2.4383866341531073, "244": 3.2268439945173775, "245": 2.128231705849268, "246": 2.8903717578961645, "247": 3.2268439945173775, "248": 3.2268439945173775, "249": 1.8918429277850375, "250": 2.128231705849268, "251": 3.7376696182833684, "252": 3.2268439945173775, "253": 3.7376696182833684, "254": 3.2268439945173775, "255": 2.6390573296152584, "256": 2.8903717578961645, "257": 3.7376696182833684, "258": 2.4383866341531073, "259": 2.4383866341531073, "260": 2.2713325494899412, "261": 3.7376696182833684, "262": 2.6390573296152584, "263": 2.2713325494899412, "264": 1.1727202608218317, "265": 2.6390573296152584, "266": 3.7376696182833684, "267": 2.8903717578961645, "268": 3.2268439945173775, "269": 3.7376696182833684, "270": 3.7376696182833684, "271": 3.7376696182833684, "272": 2.6390573296152584, "273": 2.8903717578961645, "274": 3.2268439945173775, "275": 3.7376696182833684, "276": 2.8903717578961645, "277": 3.2268439945173775, "278": 3.7376696182833684, "279": 2.4383866341531073, "280": 2.4383866341531073, "281": 3.7376696182833684, "282": 3.2268439945173775, "283": 2.8903717578961645, "284": 3.7376696182833684, "285": 3.7376696182833684, "286": 3.7376696182833684, "287": 2.4383866341531073, "288": 3.7376696182833684, "289": 3.7376696182833684, "290": 3.7376696182833684, "291": 3.2268439945173775, "292": 3.7376696182833684, "293": 3.7376696182833684, "294": 3.7376696182833684, "295": 3.7376696182833684, "296": 3.7376696182833684, "297": 3.7376696182833684, "298": 3.7376696182833684, "299": 3.7376696182833684, "300": 3.2268439945173775, "301": 3.7376696182833684, "302": 3.7376696182833684, "303": 3.7376696182833684, "304": 2.8903717578961645, "305": 2.4383866341531073, "306": 2.4383866341531073, "307": 2.2713325494899412, "308": 2.4383866341531073, "309": 3.7376696182833684, "310": 3.7376696182833684, "311": 3.7376696182833684, "312": 3.7376696182833684, "313": 3.7376696182833684, "314": 2.8903717578961645, "315": 3.7376696182833684, "316": 3.2268439945173775, "317": 3.2268439945173775, "318": 3.7376696182833684, "319": 3.7376696182833684, "320": 2.4383866341531073, "321": 3.7376696182833684, "322": 3.7376696182833684, "323": 3.7376696182833684, "324": 2.128231705849268, "325": 3.7376696182833684, "326": 3.7376696182833684, "327": 3.2268439945173775, "328": 3.2268439945173775, "329": 3.2268439945173775, "330": 2.6390573296152584, "331": 3.2268439945173775, "332": 2.003068562895262, "333": 3.2268439945173775, "334": 3.2268439945173775, "335": 2.6390573296152584, "336": 2.4383866341531073, "337": 2.8903717578961645, "338": 2.8903717578961645, "339": 2.2713325494899412, "340": 2.8903717578961645, "341": 3.2268439945173775, "342": 2.8903717578961645, "343": 3.2268439945173775, "344": 3.2268439945173775, "345": 2.6390573296152584, "346": 2.4383866341531073, "347": 2.4383866341531073, "348": 2.8903717578961645, "349": 3.7376696182833684, "350": 2.8903717578961645, "351": 3.2268439945173775, "352": 1.6174060820832772, "353": 2.8903717578961645, "354": 1.3397743454849977, "355": 3.7376696182833684, "356": 3.2268439945173775, "357": 3.2268439945173775, "358": 3.2268439945173775, "359": 2.2713325494899412, "360": 1.791759469228055, "361": 2.2713325494899412, "362": 2.2713325494899412, "363": 2.8903717578961645, "364": 2.2713325494899412, "365": 1.8918429277850375, "366": 3.2268439945173775, "367": 2.128231705849268, "368": 2.2713325494899412, "369": 1.791759469228055, "370": 2.2713325494899412, "371": 3.2268439945173775, "372": 1.5404450409471488, "373": 2.8903717578961645, "374": 2.8903717578961645, "375": 3.2268439945173775, "376": 2.6390573296152584, "377": 1.8918429277850375, "378": 3.2268439945173775, "379": 2.128231705849268, "380": 2.8903717578961645, "381": 2.8903717578961645, "382": 1.8918429277850375, "383": 1.7007876910223283, "384": 2.128231705849268, "385": 2.8903717578961645, "386": 3.2268439945173775, "387": 3.2268439945173775, "388": 3.7376696182833684, "389": 3.7376696182833684, "390": 3.7376696182833684, "391": 3.2268439945173775, "392": 3.7376696182833684, "393": 3.7376696182833684, "394": 3.7376696182833684, "395": 3.7376696182833684, "396": 3.7376696182833684, "397": 2.8903717578961645, "398": 3.2268439945173775, "399": 3.7376696182833684, "400": 3.2268439945173775, "401": 2.8903717578961645, "402": 3.7376696182833684, "403": 3.7376696182833684, "404": 3.7376696182833684, "405": 3.2268439945173775, "406": 3.2268439945173775, "407": 1.8918429277850375, "408": 3.7376696182833684, "409": 3.7376696182833684, "410": 3.7376696182833684, "411": 3.2268439945173775, "412": 2.8903717578961645, "413": 3.7376696182833684, "414": 3.7376696182833684, "415": 3.7376696182833684, "416": 3.7376696182833684, "417": 3.7376696182833684, "418": 3.7376696182833684, "419": 3.2268439945173775, "420": 2.6390573296152584, "421": 3.2268439945173775, "422": 2.4383866341531073, "423": 3.2268439945173775, "424": 2.003068562895262, "425": 3.2268439945173775, "426": 3.2268439945173775, "427": 3.7376696182833684, "428": 2.2713325494899412, "429": 3.7376696182833684, "430": 3.2268439945173775, "431": 2.8903717578961645, "432": 3.2268439945173775, "433": 3.2268439945173775, "434": 0.6931471805599453, "435": 2.4383866341531073, "436": 3.2268439945173775, "437": 3.7376696182833684, "438": 3.7376696182833684, "439": 2.4383866341531073, "440": 2.8903717578961645, "441": 3.2268439945173775, "442": 3.7376696182833684, "443": 3.7376696182833684, "444": 2.8903717578961645, "445": 3.7376696182833684, "446": 2.8903717578961645, "447": 2.8903717578961645, "448": 2.6390573296152584, "449": 2.8903717578961645, "450": 0.6931471805599453, "451": 2.2713325494899412, "452": 3.2268439945173775, "453": 3.2268439945173775, "454": 3.7376696182833684, "455": 3.7376696182833684, "456": 3.7376696182833684, "457": 3.2268439945173775, "458": 3.7376696182833684, "459": 3.7376696182833684, "460": 2.4383866341531073, "461": 3.2268439945173775, "462": 3.7376696182833684, "463": 3.7376696182833684, "464": 3.2268439945173775, "465": 3.2268439945173775, "466": 3.2268439945173775, "467": 0.10536051565782635, "468": 3.7376696182833684, "469": 3.2268439945173775, "470": 3.7376696182833684, "471": 3.7376696182833684, "472": 3.2268439945173775, "473": 3.7376696182833684, "474": 3.7376696182833684, "475": 3.2268439945173775, "476": 3.7376696182833684, "477": 3.7376696182833684, "478": 3.7376696182833684, "479": 1.7007876910223283, "480": 3.2268439945173775, "481": 3.7376696182833684, "482": 3.7376696182833684, "483": 3.7376696182833684, "484": 1.2039728043259361, "485": 0.6931471805599453, "486": 0.6931471805599453, "487": 3.7376696182833684, "488": 2.4383866341531073, "489": 2.6390573296152584, "490": 3.2268439945173775, "491": 3.2268439945173775, "492": 2.6390573296152584, "493": 3.2268439945173775, "494": 2.8903717578961645, "495": 2.8903717578961645, "496": 3.2268439945173775, "497": 2.6390573296152584, "498": 2.6390573296152584, "499": 3.2268439945173775, "500": 3.2268439945173775, "501": 3.2268439945173775, "502": 3.7376696182833684, "503": 2.6390573296152584, "504": 3.2268439945173775, "505": 3.2268439945173775, "506": 3.7376696182833684, "507": 3.2268439945173775, "508": 3.7376696182833684, "509": 3.7376696182833684, "510": 1.791759469228055, "511": 3.2268439945173775, "512": 3.7376696182833684, "513": 2.8903717578961645, "514": 3.7376696182833684, "515": 3.7376696182833684, "516": 3.7376696182833684, "517": 3.7376696182833684, "518": 3.2268439945173775, "519": 3.2268439945173775, "520": 3.7376696182833684, "521": 2.6390573296152584, "522": 3.7376696182833684, "523": 3.7376696182833684, "524": 3.7376696182833684, "525": 3.2268439945173775, "526": 3.7376696182833684, "527": 3.7376696182833684, "528": 2.6390573296152584, "529": 3.7376696182833684, "530": 3.7376696182833684, "531": 3.7376696182833684, "532": 3.7376696182833684, "533": 3.7376696182833684, "534": 3.7376696182833684, "535": 3.7376696182833684, "536": 3.7376696182833684, "537": 3.7376696182833684, "538": 3.7376696182833684, "539": 3.2268439945173775, "540": 3.2268439945173775, "541": 3.7376696182833684, "542": 3.7376696182833684, "543": 3.7376696182833684, "544": 3.7376696182833684, "545": 3.7376696182833684, "546": 3.2268439945173775, "547": 3.7376696182833684, "548": 3.2268439945173775, "549": 3.2268439945173775, "550": 3.7376696182833684, "551": 3.7376696182833684, "552": 3.7376696182833684, "553": 3.7376696182833684, "554": 3.7376696182833684, "555": 3.7376696182833684, "556": 3.7376696182833684, "557": 3.7376696182833684, "558": 3.7376696182833684, "559": 2.8903717578961645, "560": 3.7376696182833684, "561": 3.7376696182833684, "562": 3.2268439945173775, "563": 3.7376696182833684, "564": 3.7376696182833684, "565": 3.7376696182833684, "566": 3.2268439945173775, "567": 3.7376696182833684, "568": 3.7376696182833684, "569": 3.2268439945173775, "570": 2.8903717578961645, "571": 3.7376696182833684, "572": 2.8903717578961645, "573": 3.7376696182833684, "574": 3.7376696182833684, "575": 3.7376696182833684, "576": 3.7376696182833684, "577": 2.8903717578961645, "578": 2.8903717578961645, "579": 3.7376696182833684, "580": 3.2268439945173775, "581": 3.2268439945173775, "582": 3.7376696182833684, "583": 3.2268439945173775, "584": 3.7376696182833684, "585": 2.8903717578961645, "586": 3.2268439945173775, "587": 3.7376696182833684, "588": 3.7376696182833684, "589": 3.7376696182833684, "590": 3.7376696182833684, "591": 3.7376696182833684, "592": 3.2268439945173775, "593": 3.7376696182833684, "594": 3.7376696182833684, "595": 3.7376696182833684, "596": 3.7376696182833684, "597": 3.2268439945173775, "598": 3.2268439945173775, "599": 3.7376696182833684, "600": 3.7376696182833684, "601": 3.7376696182833684, "602": 3.7376696182833684, "603": 3.7376696182833684, "604": 3.7376696182833684, "605": 3.2268439945173775, "606": 3.7376696182833684, "607": 3.7376696182833684, "608": 3.7376696182833684, "609": 3.7376696182833684, "610": 3.7376696182833684, "611": 3.7376696182833684, "612": 3.7376696182833684, "613": 3.7376696182833684, "614": 3.7376696182833684, "615": 3.7376696182833684, "616": 3.7376696182833684, "617": 3.7376696182833684, "618": 3.7376696182833684, "619": 3.7376696182833684, "620": 3.7376696182833684, "621": 3.7376696182833684, "622": 3.7376696182833684, "623": 3.7376696182833684, "624": 3.7376696182833684, "625": 3.7376696182833684, "626": 3.7376696182833684, "627": 3.7376696182833684, "628": 3.7376696182833684, "629": 3.7376696182833684, "630": 3.7376696182833684, "631": 2.8903717578961645, "632": 3.2268439945173775, "633": 3.2268439945173775, "634": 3.7376696182833684, "635": 3.2268439945173775, "636": 3.2268439945173775, "637": 3.7376696182833684, "638": 3.7376696182833684, "639": 3.2268439945173775, "640": 2.8903717578961645, "641": 3.7376696182833684, "642": 3.7376696182833684, "643": 3.2268439945173775, "644": 3.7376696182833684, "645": 3.7376696182833684, "646": 3.7376696182833684, "647": 3.7376696182833684, "648": 3.7376696182833684, "649": 3.7376696182833684, "650": 3.7376696182833684, "651": 3.7376696182833684, "652": 3.7376696182833684, "653": 3.7376696182833684, "654": 3.7376696182833684, "655": 3.2268439945173775, "656": 3.7376696182833684, "657": 3.2268439945173775, "658": 3.7376696182833684, "659": 3.7376696182833684, "660": 3.7376696182833684, "661": 3.7376696182833684, "662": 3.7376696182833684, "663": 3.7376696182833684, "664": 3.7376696182833684, "665": 3.7376696182833684, "666": 3.7376696182833684, "667": 3.7376696182833684, "668": 3.7376696182833684, "669": 3.7376696182833684, "670": 3.7376696182833684, "671": 3.7376696182833684, "672": 3.7376696182833684, "673": 3.7376696182833684, "674": 3.7376696182833684, "675": 3.2268439945173775, "676": 3.2268439945173775, "677": 3.2268439945173775, "678": 0.6931471805599453}}